funkBuild/esphttpd/test_e2e/sdkconfig.defaults
# ESP32S3 QEMU Configuration with OpenCores Ethernet MAC
CONFIG_IDF_TARGET="esp32s3"

# Enable OpenCores Ethernet MAC (for QEMU)
CONFIG_ETH_USE_OPENETH=y
CONFIG_ETH_OPENETH_DMA_RX_BUFFER_NUM=16
CONFIG_ETH_OPENETH_DMA_TX_BUFFER_NUM=1

# LWIP Configuration
CONFIG_LWIP_LOCAL_HOSTNAME="esp32s3-e2e"
CONFIG_LWIP_IPV4=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# HTTP Server settings
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Disable unnecessary features for faster QEMU
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Match the production socket budget for concurrent HTTP and WebSocket tests.
CONFIG_LWIP_MAX_SOCKETS=32
